a = []
b = list([12]) # Объект списка
B = list('HELLO')
print()

#/////////////////


a = [1, 1.34, '23', [123,45]]
print(a[::-1])

#//////////////////


a = [1, 1.34, '23', [123,45]]
a[0], a[-1] = a[-1], a[0]
print (a)

#//////////////////////

a = [1, 1.34, '23', [123,45]]
b,c,*d = a
print(b,c,*d)

#////////////////////////

a = []
for i in range(101):
    if i % 2 == 0:
        a.append(i)
print(a)

#///////////////////

a = [i for i in range(101) if i % 2 == 0]
print(a)

#////////////////////

a = [1,2,3]
b = [4,5,6]
a.append(b) # a = a +b
a.extend(b)
print(a)

a.insert() # вставляет переменную в элемент с индексо

#////////////////////

a = [1,2,3]
b = a.copy() # b = list (a)
a.append(99)
print(a,b)

a.count()
a.index(15,0,-1) # возвращает наименьшее знач индекса

#////////////////////

a = [1,2,3]
b = list(a)
print(a.pop(0),a) # возвр i-й элемент и удаляет его из списка

a.remove() # отыскивает в списке а элемент со знач х и удаляет его
a.clear() # очищ список

#//////////////////////

a = [1,2,3]
for i in '23423423423'
    print(i)

#////////////////////////

a = [1,2,3]
print(12 in a)

del a[1:3]
a.reverse()
a.sort()

#//////////////

a = ['C', 'a', 'ac']
b = tuple(a)
print(b[:2])